In [2]:
import numpy as np
import pandas as pd

In [3]:
rng = np.random.RandomState(42)
ser = pd.Series(rng.randint(0, 10, 4))
ser

0    6
1    3
2    7
3    4
dtype: int64

In [4]:
df = pd.DataFrame(rng.randint(0, 10, (3, 4)),
                  columns=['A', 'B', 'C', 'D'])
df

   A  B  C  D
0  6  9  2  6
1  7  4  3  7
2  7  2  5  4

In [5]:
np.exp(ser)

0     403.428793
1      20.085537
2    1096.633158
3      54.598150
dtype: float64

In [6]:
np.sin(df * np.pi / 4)

          A             B         C             D
0 -1.000000  7.071068e-01  1.000000 -1.000000e+00
1 -0.707107  1.224647e-16  0.707107 -7.071068e-01
2 -0.707107  1.000000e+00 -0.707107  1.224647e-16

In [7]:
#index alignment in series
area = pd.Series({'Donholm': 117734, 'Ruiru': 54724, 'Transami': 453726},
                 name='area')
population = pd.Series({'Donholm': 3647565, 'Ruiru': 2453635, 'Pipeline': 254867},
                       name='population')

In [8]:
population/area

Donholm     30.981407
Pipeline          NaN
Ruiru       44.836543
Transami          NaN
dtype: float64

In [9]:
area.index

Index(['Donholm', 'Ruiru', 'Transami'], dtype='object')

In [10]:
population.index

Index(['Donholm', 'Ruiru', 'Pipeline'], dtype='object')

In [12]:
A = pd.Series([2, 4, 6], index=[0, 1, 2])
B = pd.Series([1, 3, 5], index=[1, 2, 3])
A + B

0    NaN
1    5.0
2    9.0
3    NaN
dtype: float64

In [13]:
A.add(B, fill_value=0)

0    2.0
1    5.0
2    9.0
3    5.0
dtype: float64

In [14]:
A = pd.DataFrame(rng.randint(0, 20, (2, 2)),
                 columns=list('AB'))
B = pd.DataFrame(rng.randint(0, 10, (3, 3)),
                 columns=list('ABC'))
A

   A   B
0  1  11
1  5   1

In [15]:
B

   A  B  C
0  4  0  9
1  5  8  0
2  9  2  6

In [16]:
A + B

      A     B   C
0   5.0  11.0 NaN
1  10.0   9.0 NaN
2   NaN   NaN NaN

In [18]:
fill = A.stack().mean()
A.add(B, fill_value=fill)

      A     B     C
0   5.0  11.0  13.5
1  10.0   9.0   4.5
2  13.5   6.5  10.5